{
  "main": {
    "name":"Eric Leong",
    "occupation":"Student",
    "description":"",
    "image":"profilepic.jpg",
    "bio":"Hello~ I'm Eric. I'm currently an incoming Junior at UC Berkeley. I came into Berkeley intending to study Biology and pursue the pre-med route for medical school. However, out of interest, I decided to take a Computer Science class and I enjoyed the class so much that decided to study Computer Science instead. Despite aiming to work in the industry as a Software Engineer, I am currently contributing to research in Computational Biology as it allows me to study the intersection between Computer Science and Biology.",
    "bio1":"I am also fond of Full Stack Development as a result of prior experience with Web Development. I'm currently acting as a Web Committee Co-Director of the UC Berkeley IEEE chapter where I lead the committee through multiple projects to improve the website.  I also have experience with Full Stack Development as a Software Engineering Intern at a SkyDeck startup, CatalistX, where I developed a wide variety of smaller features in addition to a few bigger ones, such as a messenger feature. ",
    "bio2":"This summer, I am working as a Software Engineering Intern at Symantec on the Norton Mobile Solutions team. I developed an automated performance testing pipeline that is usable by all the mobile apps. The pipeline is currently in use for comparing new product releases to previous ones and identifying any performance differences through analysis on collected performance data. ",
    "contactmessage":"Hello.",
    "email": "leong.eric17@berkeley.edu",
    "phone": "415-361-0558",
    "address":{
      "street":"2010 Milvia Street",
      "city":"Berkeley",
      "state":"CA",
      "zip": "94704"
    },
    "website": "https://ericleong.herokuapp.com/",
    "resumedownload":"./resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://linkedin.com/in/eric-leong",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/mageofboy",
        "className":"fa fa-github"
    },
    {
      "name":"mail",
      "url":"mailto:leong.eric17@berkeley.edu",
      "className":"fa fa-envelope-o"
    }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"University of California, Berkeley",
        "degree":"B.A. in Computer Science",
        "graduated":"August 2017 - May 2021",
        "description":["CS 61A: Structure and Interpretation of Computer Programs", "EE 16A: Designing Information Devices and Systems I", "Math 53: Multivariable Calculus", "CS 61B: Data Structures", "CS 61C: Computer Architecture", "CS 70: Discrete Math and Probability", "CS 170: Algorithms and Intractible Problems", "CS 188: Artificial Intelligence", "CS 162: Operating Systems  (In Progress)", "CS 100: Principles and Techniques of Data Science  (In Progress)", "EECS 127: Convex Optimization  (In Progress)"]
      }
    ],
    "work":[
      {
        "company":"Symantec",
        "title":"Software Engineering Intern",
        "years":"June 1, 2018 - August 22, 2019",
        "description":"Built an automated performance testing pipeline on the Mobile Security Team that uses sampled data for analysis to provide easily interpretable statistics and alerts incase of performance differences between product releases. "
      },
        {
          "company":"CatalistX",
          "title":"Software Engineering Intern",
          "years":"November 1, 2018 - February 1, 2019",
          "description":"I work with the lead developer on creating features on our product, a website that establishes a connection between growing start ups and college students interested in working at start ups."
      },
      {
        "company":"IEEE Berkeley Chapter",
        "title":"Web Committee Director",
        "years":"January 2018 - Present",
        "description":"I lead the website committee of the Berkeley branch of IEEE. As a committee, we update and develop features for our organization's website."
      },
      {
        "company":"Williams Lab",
        "title":"Undergraduate Research",
        "years":"September 2018 - Present",
        "description":"I am a research assistant for Professor Williams and Professor Sudmant, assisting them in their joint research project to find a molecular basis for convergence of dormancy. In other words, we are trying to show that all the different forms of hibernations, in both mammals and insects, have a genetic basic. So far, my partner and I have developed an algorithm that efficiently finds gene mapping, given a set of species and genes. Furthermore, we've developed a formatter that converts the output, into a structure that is readily used by many genetic analysis programs, including PAML. "
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"80%"
      },
      {
        "name":"Java",
        "level":"75%"
      },
      {
        "name":"ReactJs",
        "level":"70%"
      },
      {
        "name":"CSS",
        "level":"80%"
      },
      {
        "name":"HTML5",
        "level":"90%"
      },
      {
        "name":"Git",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Name Tag",
        "category":"Cal Hacks 2017 Project",
        "image":"nametag.jpg",
        "url":"https://devpost.com/software/nametag"
      },
      {
        "title":"Scheme Art",
        "category":"CS 61A Contest, 2nd place submission",
        "image":"scheme_art.png",
        "url":"https://inst.eecs.berkeley.edu/~cs61a/sp18/proj/scheme_gallery/#poseidon-s-kiss"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
